<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Querying in notebooks
© ExploreAI Academy

In this exercise, we will query a sample SQLite database file for a retail company called Northwind to gain some insight into their data. Ensure that you have downloaded the database file Northwind.db.

## Learning objectives

By the end of this train, you should:
- Use basic SELECT statements to retrieve specific data from a database.
- Use the WHERE clause to filter data based on certain conditions.
- Combine multiple conditions using logical operators such as AND and OR.
- Use different logical operators to get or exclude specific values in a table, including the use of IN for multiple values.

First, let's load our sample database:

In [3]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%reload_ext sql

In [4]:
# Load the Northwind database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///Northwind.db

Here is a view of all of our tables in the database:

<div align="center" style=" font-size: 100%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Northwind_ERD.png"  style="width:1000px";/>
<br>
<br>
    <em>Figure 1: Northwind ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Find the names of all customers from Germany in the Northwind database.

In [5]:
%%sql

SELECT
    ContactName
FROM
    customers
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[('Maria Anders',),
 ('Ana Trujillo',),
 ('Antonio Moreno',),
 ('Thomas Hardy',),
 ('Christina Berglund',),
 ('Hanna Moos',),
 ('Frdrique Citeaux',),
 ('Martn Sommer',),
 ('Laurence Lebihan',),
 ('Elizabeth Lincoln',)]

### Exercise 2


Find all products in the Northwind database that have a unit price greater than 30 and are discontinued. 

Note: The product has been discontinued when the column `Discontinued` is equal to  1.

In [25]:
%%sql

SELECT
    ProductName, UnitPrice, Discontinued BIT
FROM
    products
WHERE
    UnitPrice > 30
AND 
    Discontinued = 1
;

 * sqlite:///Northwind.db
Done.

[('Mishi Kobe Niku', 97, 1),
 ('Alice Mutton', 39, 1),
 ('Rssle Sauerkraut', 45.6, 1),
 ('Thringer Rostbratwurst', 123.79, 1),
 ('Perth Pasties', 32.8, 1)]

### Exercise 3


Find the contact names and phone numbers of customers from either 'USA' or 'Canada'.

In [10]:
%%sql

SELECT
    ContactName, Phone, Country
FROM
    customers
WHERE
    Country = 'USA' OR country = 'Canada';

 * sqlite:///Northwind.db
Done.

[('Elizabeth Lincoln', '(604) 555-4729', 'Canada'),
 ('Howard Snyder', '(503) 555-7555', 'USA'),
 ('Yoshi Latimer', '(503) 555-6874', 'USA'),
 ('Yoshi Tannamuri', '(604) 555-3392', 'Canada'),
 ('John Steel', '(509) 555-7969', 'USA'),
 ('Jaime Yorres', '(415) 555-5938', 'USA'),
 ('Fran Wilson', '(503) 555-9573', 'USA'),
 ('Jean Fresnire', '(514) 555-8054', 'Canada'),
 ('Rene Phillips', '(907) 555-7584', 'USA'),
 ('Paula Wilson', '(505) 555-5939', 'USA'),
 ('Jose Pavarotti', '(208) 555-8097', 'USA'),
 ('Art Braunschweiger', '(307) 555-4680', 'USA'),
 ('Liz Nixon', '(503) 555-3612', 'USA'),
 ('Liu Wong', '(406) 555-5834', 'USA'),
 ('Helvetius Nagy', '(206) 555-8257', 'USA'),
 ('Karl Jablonski', '(206) 555-4112', 'USA')]

### Exercise 4

From the 'Orders' table, select all orders that were placed by 'VINET' or 'TOMSP' and were shipped via shipper 1 or 2.

In [15]:
%%sql

SELECT
    OrderID, CustomerID, ShipVia
FROM
    Orders
WHERE
    ShipVia IN (1, 2)
AND
    CustomerID IN ('VINET', 'TOMSP');

 * sqlite:///Northwind.db
Done.

[(10249, 'TOMSP', 1),
 (10274, 'VINET', 1),
 (10295, 'VINET', 2),
 (10438, 'TOMSP', 2),
 (10446, 'TOMSP', 1),
 (10548, 'TOMSP', 2),
 (10608, 'TOMSP', 2),
 (10737, 'VINET', 2),
 (10967, 'TOMSP', 2)]

### Challenge question

Find the employees in the Northwind database who are either Sales Representatives or Sales Managers and are based in London.

In [29]:
%%sql

SELECT
    FirstName,
    LastName
FROM
    employees
WHERE 
    (Title = 'Sales Representative' OR Title = 'Sales Manager') 
    AND City = 'London';

 * sqlite:///Northwind.db
Done.

[('Steven', 'Buchanan'),
 ('Michael', 'Suyama'),
 ('Robert', 'King'),
 ('Anne', 'Dodsworth')]

## Solutions

### Exercise 1

In [ ]:
%%sql
SELECT 
    ContactName 
FROM 
    Customers 
WHERE 
    Country = 'Germany';

### Exercise 2

In [ ]:
%%sql

SELECT 
    ProductName, Discontinued
FROM 
    Products 
WHERE 
    UnitPrice > 30 
    AND Discontinued = 1;

### Exercise 3

In [ ]:
%%sql

SELECT 
    ContactName, 
    Phone 
FROM 
    Customers 
WHERE 
    Country IN ('USA', 'Canada');

### Exercise 4

In [ ]:
%%sql

SELECT 
    * 
FROM 
    Orders 
WHERE 
    CustomerID IN ('VINET', 'QUICK', 'SUPRD')
    AND ShipVia IN (1,2);

### Challenge question

In [27]:
%%sql

SELECT 
    FirstName, 
    LastName 
FROM 
    Employees 
WHERE 
    (Title = 'Sales Representative' OR Title = 'Sales Manager') 
    AND City = 'London';

 * sqlite:///Northwind.db
Done.

[('Steven', 'Buchanan'),
 ('Michael', 'Suyama'),
 ('Robert', 'King'),
 ('Anne', 'Dodsworth')]

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>